Revit 2024 API
BuiltInFailures.ImportFailures.CannotChangeImportSymbol Property
 Can't change an imported or linked element's symbol type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotChangeImportSymbol { get; }
Visual Basic
Public Shared ReadOnly Property CannotChangeImportSymbol As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotChangeImportSymbol {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace